/**
 * @url /reuse/sc/product/hqcc/r/detailErrorResult
 */

module.exports = {
  msg: '',
  code: 0,
  data: {
    "title": "编辑 [可口可乐]",
    "list": [
      "主门店:2868068, 分类:会员商品,商品数:8",
      "主门店:2868068, 分类:健康杂粮,商品数:48",
      "主门店:2868068, 分类:烹饪油,商品数:34",
      "主门店:2868068, 分类:南北干货,商品数:50",
      "主门店:2868068, 分类:饮料,商品数:13",
      "主门店:2868068, 分类:料酒调汁,商品数:15",
      "分店:2868066, 分类:米/面/粉,删除商品数:0",
      "分店:2868066, 分类:米/面/粉,修改商品数:46",
      "分店:2868066, 分类:会员商品,修改商品数:8",
      "分店:2868066, 分类:健康杂粮,删除商品数:0",
      "分店:2868066, 分类:健康杂粮,修改商品数:48"
    ]
  }
}
